app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" ORDER BY created_at DESC
---
  def index
    @docs = Doc.all.order("created_at DESC")