app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = 1 ORDER BY created_at DESC
---
  def index
    @docs = Doc.where(user_id: current_user).order("created_at DESC")

INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asf"], ["content", "asdfasdf"], ["created_at", "2017-06-06 20:40:57.171550"], ["updated_at", "2017-06-06 20:40:57.171550"], ["user_id", 1]]
---
  def create
    @doc = current_user.docs.build(doc_params)

    if @doc.save

UPDATE "docs" SET "content" = $1, "updated_at" = $2 WHERE "docs"."id" = $3  [["content", "a"], ["updated_at", "2017-06-06 19:14:26.859846"], ["id", 2]]
---
  def update
    if @doc.update(doc_params)

DELETE FROM "docs" WHERE "docs"."id" = $1  [["id", 1]]
---
  def destroy
    @doc.destroy

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_doc
      @doc = Doc.find(params[:id])